% function PR = PR_Friction(Dw,Dc)
function PR = PR_Friction(Dw,Dc)
% 汪海阁的偏心环空压耗计算
% PR:偏心环空压耗与同心环空压耗之比
% E:钻具偏心度（等于1减居中度）
% fai:动塑比（宾汉流体屈服值/塑性粘度）
% sigma:环空内外管径比（小于1）
E = 0;
% fai = 3.675/0.016;
fai = 12;%这个数自己赋值吧……(ZZ要动态得到这个比值还是太难了，根据流变性结果得出也不太可靠),12 其实可以得到一个随时间变化的动态公式（12月23日）
sigma = Dc/Dw;
% PR = 1.0-(0.1045*fai+0.073)*E*sigma^0.8454-0.8841*fai^(-0.28879)*E^2*sigma^0.1852+0.5658*fai^(-0.28879)*E^3*sigma^0.2527;
% 修正后的代码
PR = 1.0-(0.1045.*fai+0.073).*E.*sigma.^0.8454-0.8841.*fai.^(-0.28879).*E.^2.*sigma.^0.1852+0.5658.*fai.^(-0.28879).*E.^3.*sigma.^0.2527;

end

